app/Views/auth/dashboard.php

                            $db = \Config\Database::connect();
                            foreach ($courses as $index => $c):
                                $courseId = $c['id'];
                                $students = $db->table('enrollments')
                                    ->select('users.name')
                                    ->join('users', 'users.id = enrollments.user_id')
                                    ->where('enrollments.course_id', $courseId)
                                    ->get()->getResultArray();
---
SELECT `users`.`name`
FROM `enrollments`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `enrollments`.`course_id` = '1'