app/Controllers/Admin.php

    public function dashboard()
    {
        // Check if user is logged in and is an admin
        if (!session()->get('logged_in') || session()->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Please log in as an admin.');
        }

        $userModel = new UserModel();
        $announcementModel = new \App\Models\AnnouncementModel();
        $courseModel = new \App\Models\CourseModel();
        $enrollmentModel = new \App\Models\EnrollmentModel();

        // Fetch all users grouped by role
        $allUsers = $userModel->findAll();
        $totalUsers = count($allUsers);
        $totalStudents = count(array_filter($allUsers, fn($u) => $u['role'] === 'student'));
        $totalTeachers = count(array_filter($allUsers, fn($u) => $u['role'] === 'teacher'));
        $totalAdmins = count(array_filter($allUsers, fn($u) => $u['role'] === 'admin'));

        // Fetch announcements
        $totalAnnouncements = $announcementModel->countAllResults();
        $announcements = $announcementModel->orderBy('created_at', 'DESC')->limit(5)->findAll();

        // Fetch courses
        $courses = $courseModel->findAll();
        $totalCourses = count($courses);

        // Fetch enrollments
        $totalEnrollments = $enrollmentModel->countAllResults();
---
SELECT *
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `announcements`
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `enrollments`

    public function users()
    {
        // Check if user is logged in and is an admin
        if (!session()->get('logged_in') || session()->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Please log in as an admin.');
        }

        $userModel = new UserModel();
        $users = $userModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC