app/Controllers/Auth.php

    public function register()
    {
        // If already logged in → go to dashboard
        if (session()->get('logged_in')) {
            return redirect()->to(site_url('dashboard'));
        }

        if ($this->request->getMethod() === 'POST') {
            // Normalize fields to prevent duplicates and special chars
            $postData = $this->request->getPost();
            $postData['name']  = trim($postData['name'] ?? '');
            $postData['email'] = strtolower(trim($postData['email'] ?? ''));
            $this->request->setGlobal('post', $postData);

            // Validate form
            if (!$this->validate([
                'name'             => 'required|min_length[3]|max_length[50]|alpha_space',
                'email'            => 'required|valid_email|is_unique[users.email]',
                'password'         => 'required|min_length[4]',
                'confirm_password' => 'matches[password]',
            ])) {
                return redirect()->back()
                    ->withInput()
                    ->with('errors', $this->validator->getErrors());
            }

            $userModel = new UserModel();
            $normalizedEmail = $this->request->getPost('email');
            // Extra guard against case-sensitive duplicates
            if ($userModel->where('LOWER(email)', strtolower($normalizedEmail))->first()) {
---
SELECT *
FROM `users`
WHERE LOWER(email) = 'asdfgh@gmail.com'
 LIMIT 1