app/Controllers/Auth.php

    public function dashboard()
    {
        $session = session();

        // ✅ Check login
        if (!$session->get('logged_in') || !$session->get('id')) {
            return redirect()->to('/login')->with('error', 'Please log in first.');
        }

        $db = \Config\Database::connect();
        $user_id   = (int) $session->get('id');
        $user_name = $session->get('name');
        $user_role = $session->get('role');

        // ✅ Handle enrollment (POST request)
        if ($this->request->getMethod() === 'POST') {
            $course_id = (int) $this->request->getPost('course_id');

            if (empty($course_id) || empty($user_id)) {
                return $this->response->setJSON([
                    'status'  => 'error',
                    'message' => 'Invalid course or user.'
                ]);
            }

            // Check if already enrolled
            $exists = $db->table('enrollments')
                ->where('user_id', $user_id)
                ->where('course_id', $course_id)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = 3
AND `course_id` = 1

        }

        // ✅ Load all courses
        $courses = $db->table('courses')
            ->select('id, title, description')
            ->get()
            ->getResultArray();

        // ✅ Load user’s enrolled courses
        $enrolledCourses = $db->table('enrollments')
            ->select('courses.id, courses.title')
            ->join('courses', 'enrollments.course_id = courses.id')
            ->where('enrollments.user_id', $user_id)
            ->get()
            ->getResultArray();
---
SELECT `id`, `title`, `description`
FROM `courses`
SELECT `courses`.`id`, `courses`.`title`
FROM `enrollments`
JOIN `courses` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `enrollments`.`user_id` = 1

        // ✅ Admin: view all users
        $users = [];
        if ($user_role === 'admin') {
            $users = $db->table('users')
                ->select('id, name, email, role')
                ->get()
                ->getResultArray();
---
SELECT `id`, `name`, `email`, `role`
FROM `users`