app/Models/CourseModel.php

SELECT *
FROM `courses`
ORDER BY `title` ASC
---
    public function search(?string $term = null): array
    {
        $builder = $this->builder()
            ->orderBy('title', 'ASC');

        if (!empty($term)) {
            $builder->groupStart()
                ->like('title', $term)
                ->orLike('description', $term)
                ->orLike('course_code', $term)
                ->groupEnd();
        }

        return $builder->get()->getResultArray();