app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '1'
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();

SELECT *
FROM `notifications`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getNotificationsForUser($userId)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll(5);

UPDATE `notifications` SET `is_read` = 1
WHERE `id` = '2'
AND `user_id` = '3'
---
    public function markAsRead($id, $userId = null)
    {
        $conditions = ['id' => $id];

        if ($userId !== null) {
            $conditions['user_id'] = $userId;
        }

        return $this->where($conditions)
                    ->set(['is_read' => 1])
                    ->update();