app/Models/UserModel.php

    public function createAccount(array $data)
    {
        // Hash password before saving
        $data['password'] = password_hash($data['password'], PASSWORD_DEFAULT);

        $this->insert($data);
---
INSERT INTO `users` (`name`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('assdfg', 'asdfgh@gmail.com', '$2y$10$QWJ26lte5WoCOnVspNVXOOMrCoIjF7vQLSVLStjedBns3TCPjfqpG', 'student', '2025-12-10 09:55:20', '2025-12-10 09:55:20')

    public function findUserByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'sige@gmail.com'
 LIMIT 1